# -*- coding: utf-8 -*-
import re
import sys

with open('./log.txt', 'w') as f:
    for d in sys.path:
        f.write("%s\n" % d) 


# Janomeを使うための宣言 
from janome.tokenizer import Tokenizer


# 「ツイート」を読み込む --- (*1)
fp = open("../data/tweet.txt", "rt", encoding="utf-8")
text = fp.read()

# Janomeの準備 --- (*2)
tok = Tokenizer()
tokens = tok.tokenize(text)

# 形態素をカウント --- (*3)
counter = {}
for t in tokens:
    ps = t.part_of_speech
    word = t.surface
    
    if re.fullmatch("[あ-ん]",word) == None and  (ps.find("動詞") >= 0 or ps.find("名詞") >= 0 or ps.find("形容詞") >= 0 or ps.find("副詞") >= 0):
        bf = t.base_form
        if not bf in counter: counter[bf] = 0
        counter[bf] += 1
    


# カウントの多い順に並び替える --- (*4)
sc = sorted(counter.items(), key=lambda x: x[1], reverse=True)
# 並び替えたものを表示 --- (*5)

num = 1

for i, t in enumerate(sc):
    if i >= 100: break
    key, cnt = t
    
    exclusion_words = [
   "0","1","2","3","4","5","6","7","8","9",
   "10","11","12","13","14","15","16","17","18","19",
   "20","21","22","23","24","25","26","27","28","29",
   "30","31","32","33","34","35","36","37","38","39",
   "40","41","42","43","44","45","46","47","48","49",
   "50","51","52","53","54","55","56","57","58","59",
   "60","61","62","63","64","65","66","67","68","69",
   "70","71","72","73","74","75","76","77","78","79",
   "80","81","82","83","84","85","86","87","88","89",
   "90","91","92","93","94","95","96","97","98","99",
    "A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
    "a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
    ":","：","、"," ", "　","@","@@","@·","\n","。",",",".","!","！","?","？","/",";","^","ー","·","%","-","_","・","#","$","～","~","=",
    "あ","ぃ","い","ぅ","う","ぇ","え","ぉ","お","か","が","き","ぎ","く","ぐ","け","げ","こ","ご",
    "さ","ざ","し","じ","す","ず","せ","ぜ","そ","ぞ","た","だ","ち","ぢ","っ","つ","づ","て","で",
    "と","ど","な","に","ぬ","ね","の","は","ば","ぱ","ひ","び","ぴ","ふ","ぶ","ぷ","へ","べ","ぺ",
    "ほ","ぼ","ぽ","ま","み","む","め","も","ゃ","や","ゅ","ゆ","ょ","よ","ら","り","る","れ","ろ","ゎ","わ","ゐ","ゑ","を","ん","ゔ",
    "です","ます","ない","ある","する","たい","なる","みたい","てる","いる",
    "hReplying","mReplying","sReplying","to","Show","this","thread","com","co","jp","://","https",
    "[","]","{","}","(",")","【","】","「","」","『","』"]
    
    if(key not in exclusion_words):
        print("<tr><td>" + str(num) + "</td><td>" + key + "</td><td>" + str(cnt) + "</td></tr>")
        num += 1